content/main/20211011005922-academic_machine.md
+++
title = "Academic Machine"
author = ["System Administrator"]
draft = false
+++

This machine do academic activities.(get good grade in university; come up with good academic product)
The machine consist of 3 sub machines particularly for academic sucess:

-   Tutor Machine
-   Self-Learning Machine
-   Homework Machine


## Status {#status}


### Current Project {#current-project}

[XJTLU-Y2S1]({{< relref "20211007011521-xjtlu_y2s1.md" >}})


### Upcoming Project {#upcoming-project}


#### XJTLU {#xjtlu}

-   XJTLU-Y2S2


#### Liverpool University {#liverpool-university}


#### (optional) 研究生？ {#optional--研究生}


#### Doctor in Neuralscience {#doctor-in-neuralscience}


## Submachines {#submachines}


### [Self-Learning Machine]({{< relref "20211011015906-self_learning_machine.md" >}}) {#self-learning-machine--20211011015906-self-learning-machine-dot-md}

Should be ahead of time.
Session regularly scheduled 2 days before a formal tutoring session. others as my wave goes.


### Tutor Machine {#tutor-machine}

This machine apply to classes, lectures, tutorials, and **office hours**.
Emphasis on the **TUTOR** presence. Find Professor, TA or classmates to tutor myself
Really use **Office Hours**


#### Principle {#principle}

<!--list-separator-->

-  Think before ask

    communication have following disadvantags:

    -   Cost energy
    -   Easy to distract
    -   sometimes hard to follow and/or explain clearly

    Therefore, should leave communication in the first (as in [Metalearning]({{< relref "20211011023115-metalearning.md" >}})) or the last solution.

<!--list-separator-->

-  Always Log

    One of my crucial flaw of taking tutoring sessions is that things would vanish in the wind as I trying follow up while finding and remembering my questions.
    Log the questions as they pop up.

<!--list-separator-->

-  Prepared

    Best go to tutoring sessions with preparation(made in [self-study]({{< relref "20211011015906-self_learning_machine.md" >}})):

    -   to content
        so there will be 余裕 to raise questions
    -   to activitiy
        got a list of questions to ask or clarify


#### Flow {#flow}

<!--list-separator-->

-  1. [Preview]({{< relref "20211011015906-self_learning_machine#1-dot-schedule" >}})

    1.  Schedule
        2 day before
        Tutoring on Mon., Preview on Sat.
    2.  Self study.

<!--list-separator-->

-  2. Tutoring

<!--list-separator-->

-  3. Log


### Homework Machine {#homework-machine}

This machine apply to any work/Coursework that would count in credit. Include preparation for exam
practice for learning prupose is in self-learning machine.


#### Principle {#principle}

<!--list-separator-->

-  As Fast As possible

    Finish every homework as fast as possible


#### Flow {#flow}

<!--list-separator-->

-  1. Record

    Record the homework immediately
    ways are:

    -   in Task.org(by C-c c tt task entry)
    -   in the module node "Task" heading
    -   in the "homework.org" file, if I'm going to have one

    either 3 ways, the TODO should be tagged `:homework:`